<nav>
    <span class="h5"><a href="?page=catalog">Каталог товаров</a></span>
    <ul>
        <li><a href="#">Телефоны, планшеты и аксессуары</a></li>
        <li><a href="#">Аккумуляторы, элементы питания</a></li>
        <li><a href="#">Чехлы для телефонов</a></li>
        <li><a href="#">Запчасти для телефонов и электроники</a></li>
        <li><a href="#">Оборудование для ремонта</a></li>
        <li><a href="#">Компьютерная техника</a></li>
        <li><a href="#">Аудио, видеотехника и аксессуары</a></li>
        <li><a href="#">Все категории</a></li>
    </ul>
</nav>